# Full dev-setup Homebrew catalog.
# install.sh generates ~/.config/dev-setup/Brewfile.selected from user choices.

# Apps
cask "ghostty"
cask "raycast"
cask "font-jetbrains-mono-nerd-font"

# Shell ergonomics
brew "atuin"
brew "direnv"
brew "fzf"
brew "mise"
brew "starship"
brew "zoxide"

# Modern Unix replacements
brew "bat"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "git-delta"
brew "jq"
brew "ripgrep"
brew "sd"
brew "yq"

# Logs, monitoring, and TUIs
brew "btop"
brew "lazygit"
brew "lnav"
brew "tailspin"
brew "tmux"
brew "yazi"

# Code editing and quality
brew "actionlint"
brew "ast-grep"
brew "hadolint"
brew "markdownlint-cli"
brew "neovim"
brew "shellcheck"
brew "shfmt"
brew "taplo"
brew "tokei"
brew "typos-cli"
brew "yamllint"

# Git extras
brew "difftastic"
brew "git-extras"
brew "git-filter-repo"
brew "git-lfs"
brew "jj"
brew "pre-commit"

# Network and API diagnostics
brew "aria2"
brew "bandwhich"
brew "doggo"
brew "gping"
brew "iperf3"
brew "mtr"
brew "nmap"
brew "trippy"
brew "wget"

# Data and file wrangling
brew "csvkit"
brew "dasel"
brew "duckdb"
brew "fx"
brew "jless"
brew "miller"
brew "sqlite"
brew "visidata"
brew "xsv"

# Containers and Kubernetes
brew "colima"
brew "docker"
brew "docker-compose"
brew "helm"
brew "helmfile"
brew "k9s"
brew "kind"
brew "kubectl"
brew "kubectx"
brew "lazydocker"
brew "stern"

# Cloud and infrastructure
brew "awscli"
brew "azure-cli"
brew "doctl"
brew "flyctl"
brew "google-cloud-sdk"
brew "opentofu"

# Security and supply chain
brew "age"
brew "cosign"
brew "gitleaks"
brew "grype"
brew "sops"
brew "syft"
brew "trufflehog"

# Media and documents
brew "ffmpeg"
brew "imagemagick"
brew "pandoc"
brew "poppler"
brew "rclone"
brew "sevenzip"

# Language runtime helpers
brew "bun"
brew "deno"
brew "pnpm"
brew "uv"

# Local and CLI AI tools
brew "aichat"
brew "llm"
brew "mods"
brew "ollama"

# Developer workflow helpers
brew "gh"
brew "gum"
brew "hyperfine"
brew "just"
brew "xh"
