# Core launcher / terminal apps
cask "ghostty"
cask "raycast"
cask "font-jetbrains-mono-nerd-font"

# Shell ergonomics
brew "atuin"
brew "direnv"
brew "fzf"
brew "mise"
brew "starship"
brew "zoxide"

# Modern Unix replacements
brew "bat"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "git-delta"
brew "jq"
brew "ripgrep"
brew "sd"
brew "yq"

# Logs, monitoring, and TUIs
brew "btop"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "lnav"
brew "tailspin"
brew "tmux"
brew "yazi"

# Developer workflow helpers
brew "gh"
brew "gum"
brew "hyperfine"
brew "just"
brew "xh"
